<pad>
<unk>
<sos>
<eos>
to
i
.
the
troops
and
on
continent
,
of
in
that
my
a
red
be
as
green
purple
me
from
blue
attack
it
have
is
there
control
this
yellow
so
will
can
also
would
able
with
continents
take
one
other
for
put
over
defend
was
move
then
all
countries
at
only
placed
two
more
want
because
by
wanted
territory
could
'
territories
access
well
out
give
strategy
an
are
country
if
which
make
not
while
or
am
into
battle
win
player
since
each
place
them
try
attacks
both
get
battles
map
up
but
decided
gain
like
start
they
most
against
has
protect
game
troop
4
chance
first
purple_a
gives
red_a
opportunity
t
having
occupied
3
enemy
any
green_d
think
strong
least
2
best
good
red_c
number
those
had
taking
players
turn
’
black
position
s
borders
do
need
sure
order
some
spread
way
being
board
going
plan
blue_b
easily
occupy
d
time
5
attacking
fight
green_e
purple_e
should
were
chose
entire
felt
hold
placing
after
keep
once
blue_a
go
goal
great
many
blue_c
these
advantage
already
right
where
yellow_c
quickly
red_b
attacked
defending
expand
just
now
unoccupied
ability
enough
fortify
off
possible
their
amount
blue_d
either
lot
allow
area
five
much
myself
no
still
empty
here
than
yellow_b
1
areas
bonus
border
controlling
putting
three
across
base
feel
large
next
units
four
grey
total
about
another
armies
army
different
early
few
forces
m
point
conquer
defense
occupying
thought
defended
enemies
focus
green_a
opponents
see
set
together
trying
yellow_d
don
every
help
play
round
same
vulnerable
6
additional
gave
made
rest
seems
use
very
14
7
allows
c
defensive
extra
look
winning
based
defeat
eventually
fortified
giving
important
launch
needed
open
presence
protected
spot
stronghold
tried
when
yellow_a
you
10
avoid
easy
force
looked
looks
multiple
opponent
prevent
remaining
saw
too
whole
choose
complete
currently
end
establish
full
gray
hope
however
moves
moving
numbers
stronger
around
believe
doing
green_c
immediately
left
likely
making
opportunities
(
)
close
controlled
did
green_b
hopefully
how
land
others
own
secure
therefore
-
b
begin
better
between
build
didn
its
maintain
probably
single
slowly
small
soon
strategic
under
what
within
work
although
before
beginning
keeping
less
looking
maximize
might
neighboring
occupation
onto
option
points
positions
purple_b
push
strategically
surround
turns
until
yet
away
back
coming
completely
even
expanding
immediate
let
potentially
purple_d
really
risk
surrounding
through
took
available
battling
case
come
easiest
eliminate
focused
further
holding
invasion
larger
protecting
starting
threat
weak
why
without
advance
bit
cannot
capture
depending
does
easier
fighting
finally
foothold
fully
happen
heavily
hopes
initial
knew
location
makes
opposing
pick
rather
reinforcements
setup
split
spreading
stationed
thus
weakest
worry
adjacent
again
boost
controls
couple
ensures
focusing
getting
hard
high
incoming
increase
last
later
lose
may
means
mostly
nine
options
overall
overwhelming
per
placement
possibly
securing
six
such
taken
8
9
add
anyone
bat
beat
create
direct
else
figured
gaining
held
idea
instead
invade
ll
majority
method
mine
moved
must
ones
overtake
path
pieces
places
potential
pretty
purple_c
region
second
seem
side
strongest
though
towards
we
world
allowing
attempt
been
boarders
concentrate
directly
ensure
fewest
future
goes
groups
highly
home
leave
lets
main
maybe
necessary
offensive
part
paths
perhaps
power
reach
ready
secondary
sides
smaller
spots
stake
strike
support
things
vulnerabilities
weaker
went
afford
anything
behind
chances
comes
concentrated
conflict
considering
consolidate
cover
damage
deal
defensively
destroy
divided
e
entirely
established
expansion
far
given
grow
higher
huge
intend
invading
know
level
lightly
little
long
lots
maintaining
march
max
minimal
mobility
neither
north
particular
reason
said
secured
seize
send
started
stay
thin
via
who
won
wouldn
12
act
added
additionally
allowed
always
anywhere
assume
benefit
bordering
break
built
care
certain
challenge
clear
connected
consolidated
decent
defenses
deployment
difficult
done
down
during
entirety
entrance
evenly
everyone
except
figure
flexibility
fortifying
forward
free
gets
goals
got
greater
half
happened
hoping
initially
invaded
isn
lead
locked
mass
minimum
movement
near
nearby
needs
new
operations
person
picked
primary
provide
provides
puts
quite
reinforce
safe
safely
seemed
sense
separate
silver
slow
sole
specifically
stacked
strength
success
surrounded
takeover
thing
throughout
top
ultimately
using
wipe
